code-review/NRB_3471_3546/База_Было/Documents/НазначениеПредставителяСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеПредставителяСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПредставителиСчетаДепо</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПредставителяСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредставителейСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенностиПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НазначениеПредставителяСчетаДепо/Ext/ObjectModule.bsl
//Обработчик события создания документа "Назначение представителя счета депо" на основании.
//
Процедура ОбработкаЗаполнения(Основание)
	
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") 
		Или ТипЗнч(Основание) = Тип("ДокументОбъект.Поручение") Тогда
		
		Если 	Основание.ВидОперацииД   = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо 
			ИЛИ Основание.ВидОперацииД   = Справочники.ВидыОпераций.НазначениеПопечителяСчетаДепо 
			ИЛИ Основание.ВидОперацииД   = Справочники.ВидыОпераций.НазначениеРаспорядителяСчетаДепо	Тогда
			
			ДокументОснование 				= Основание.Ссылка;			
			ВладелецСчета 					= Основание.Инициатор;
			СчетДепо						= Основание.СчетДепо;
			ВидПредставителяСчетаДепо 		= Основание.ВидПредставителяСчетаДепо;
			ПредставительСчетаДепо			= Основание.ПредставительСчетаДепо;
			НомерДоверенностиПредставителя  = Основание.НомерДоверенностиПредставителя;
			ДатаНачалаДоверенности			= Основание.ДатаНачалаДоверенности;
			ДатаОкончанияДоверенности		= Основание.ДатаОкончанияДоверенности;
			Дата							= Основание.ДатаИсполненияПоручения;
			
		Иначе
			
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ Назначение представителя счета депо !!!");
			Возврат;	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверка  ВидПредставителяСчетаДепо.
	Если Не ЗначениеЗаполнено(ВидПредставителяСчетаДепо) 
		ИЛИ Не ЗначениеЗаполнено(ПредставительСчетаДепо) Тогда
		
		Сообщить("Не заполнен вид или не выбран представитель счета депо!");
		Отказ	=	Истина;
		
	КонецЕсли; 
	
	//проверка  ВладелецСчета.
	Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(ВладелецСчета) Тогда
		
		Сообщить("Не заполнены реквизиты документа!!!");
		Отказ = Истина;
	
	КонецЕсли; 

	Если ВидПредставителяСчетаДепо = Перечисления.ВидыПредставителейСчетаДепо.Оператор      Тогда
		ОперацияУслуги = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо; 
	ИначеЕсли ВидПредставителяСчетаДепо = Перечисления.ВидыПредставителейСчетаДепо.Попечитель Тогда 												
		ОперацияУслуги = Справочники.ВидыОпераций.НазначениеПопечителяСчетаДепо; 
	ИначеЕсли ВидПредставителяСчетаДепо = Перечисления.ВидыПредставителейСчетаДепо.Распорядитель Тогда
		ОперацияУслуги = Справочники.ВидыОпераций.НазначениеРаспорядителяСчетаДепо; 
	КонецЕсли;											
  	
	Движение 									= Движения.ПредставителиСчетаДепо.Добавить();
	Движение.Период								= Дата;
	Движение.СчетДепо 							= СчетДепо;		  
	Движение.ВидПредставителя 					= ВидПредставителяСчетаДепо;
	Движение.Представитель 						= ПредставительСчетаДепо;
	Движение.СтатусПредставителя 				= Перечисления.СтатусыПредставителей.Назначен;
	Движение.НомерДоверенности      			= НомерДоверенностиПредставителя;
	Движение.ДатаНачалаДействияДоворенности		= ДатаНачалаДоверенности;
	Движение.ДатаОкончанияДействияДоверенности	= ДатаОкончанияДоверенности;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
